{"pageProps":{"postData":{"id":"FIRST_Fun","contentHtml":"<p>Robots are fun. Competition is fun. Innovation is fun. Competing with innovative robots … that’s almost more fun than anybody should be allowed to have! </p>\n<p>It is no accident that one of FIRST's core values is “Fun: We enjoy and celebrate what we do!” When Dean Kamen and Woodie Flowers <a href=\"FIRST_Teamwork\"> teamed up </a> to create FIRST, they wanted to inspire students, and what is more inspiring than having fun solving hard problems? Beginning in 1992, students have attended FIRST Robotics Competitions (FRC) and, through the heat of battle, everybody is having fun! The inaugural competition set the tone for the next 30 years of FRC. The technology has evolved and FIRST has gone global, but one thing remains constant - FIRST starts with fun.</p>\n<p><img src=\"/static/images/blog/dec09_23/FIRSTvalues.png\" alt=\"\" /></p>\n<p><strong><em>Why Fun Matters</em></strong></p>\n<p>Fun is a core value of FIRST because students learn better when they are enjoying themselves. Dean Kaman founded FIRST because he believes that it creates a learning environment that is more likely to nurture the next generation of innovators and creators. Kamen’s three principles for creating a fun learning environment are:</p>\n<ol>\n<li><p>Motivation - “Kids want aspirational activities.” School's structure drains students’ motivation. Taking attendance, assigning mundane tasks, and monitoring student activity is a relic from the Industrial Age that turns even the most interesting subjects into “work.” On the other hand, when students are free to explore and solve problems to achieve their goals and help the team, they will work endless hours. Assigned activities are work; achieving your aspirations is fun.</p></li>\n<li><p>Support - “Kids should be allowed to fail.” School grading focuses on critiquing weaknesses, rather than celebrating strengths. It also tends to judge students against one another, fostering division instead of teamwork. Students become so afraid to fail that they are unwilling to take risks. On the other hand, when they can experiment without judgment, they break boundaries and innovate. Reaching a homogenized answer is tedious; innovation is fun. </p></li>\n</ol>\n<p><img src=\"/static/images/blog/dec09_23/KamenSupport.jpg\" alt=\"\" /></p>\n<ol start=\"3\">\n<li>Passion - “Kids want to get better at what they care about.” School forces students to learn and be graded on the same classes, content and criteria, regardless of their interests. However, on a robotics team, each student can explore their passion and make a unique contribution to the team. Being a cog in a machine is dehumanizing; following your passion is fun. </li>\n</ol>\n<p>Kamen is fond of making an analogy between sports teams and robotics teams. Students willingly spend hours on sports because “there are no quizzes, there are no tests. There are tournaments and there are trophies and there are mascots and there are school bands.” In other words, sports are fun. Kamen created FIRST to give students the “sports” experience in STEM. With FIRST, STEM is fun. </p>\n<p><img src=\"/static/images/blog/dec09_23/FIRST-logo.webp\" alt=\"\" /></p>\n<p><strong><em>1992 - The First FIRST Competition</em></strong></p>\n<p>In 1992, the world was very different. The Cold War had just ended. The US Men’s Basketball “Dream Team” dominated the Olympics in Barcelona, Spain. Bill Clinton was elected President of the United States. The Internet was not part of people’s lives, almost every phone call was made on a landline, laptops were still uncommon, and <a href = \"Blendo\"> robotics competitions</a> were just beginning. </p>\n<p><img src=\"/static/images/blog/dec09_23/dream-team.jpg\" alt=\"\" width=\"200\" height=\"160\" /></p>\n<p>In 1992, FIRST held its inaugural US Competition at Memorial High School in Manchester, NH.  </p>\n<p><img src=\"/static/images/blog/dec09_23/Maize_Craze_Logo.jpg\" alt=\"\" /></p>\n<p>“Maize Craze” created the template for all subsequent FRC competitions. Nonviolent robots worked to achieve a complex task in a finite period of time. Each two minute round featured four robots that each tried to collect the greatest value of tennis balls. There were 150 “one point” balls in the center of the arena, four “high value” balls on poles at the corners, and one “high value” ball on a pole in the center of the arena. The arena itself was covered in 1.5 inches of corn kernels to make it more difficult to steer the robots. To get credit for the balls it collected, the robot had to dock back at its home base before the round ended. </p>\n<p>The competition, however, reflected the limitations of the technology of the early 1990s. The robots were plugged into outlets in the ceiling because battery technology was not sufficiently advanced or inexpensive to power the robots. Therefore, the robot drivers had to also avoid getting their “umbilical” power cords tangled. Fortunately, the drivers were able to use remote controls, similar to those that controlled RC cars, to drive their robots, so there were not also wires on the field. There was also no “autonomous” phase since processors and software were not sufficiently advanced.  </p>\n<p><img src=\"/static/images/blog/dec09_23/umbilicals.jpg\" alt=\"\" /></p>\n<p>The competition also shows how FIRST evolved the competitions over the years. First, each robot competed individually. The principle of working together in teams came later. Second, the entire competition included only 28 schools, almost entirely from the East Coast. Over time FIRST would have over 90,000 participants! Finally, the competition was not streamed on YouTube, which did not exist, but somebody did videotape the final match. They did post it on YouTube in 2008!</p>\n<p><strong><em>Students and Fun Don’t Change</em></strong></p>\n<p>The one constant in FIRST competitions is the students having fun. When watching videos of those initial matches, a few things are obvious:</p>\n<ol>\n<li>Safety goggles were ubiquitous, even in 1992</li>\n</ol>\n<p><img src=\"/static/images/blog/dec09_23/SafetyGoggles.jpg\" alt=\"\" /></p>\n<ol start=\"2\">\n<li>The drivers and crowd are all passionate about what they are doing. Even watching grainy 30-year old footage, it is clear that Kamen and Flowers had created the sporting environment that they wanted. </li>\n</ol>\n<p><img src=\"/static/images/blog/dec09_23/Maize_Craze_190.jpg\" alt=\"\" /></p>\n<ol start=\"3\">\n<li>Creativity. Each of the final robots has a different design. Some were low sweepers aiming for the 150 tennis balls, while others were built to go after the high value balls on poles. </li>\n</ol>\n<p>The team from Clinton, MA won with their robot Nypro, which gathered balls almost like a thresher gathers wheat, and they were invited to meet President George H.W. Bush. </p>\n<p><img src=\"/static/images/blog/dec09_23/ClintonRobots.jpg\" alt=\"\" />\n<img src=\"/static/images/blog/dec09_23/PresidentBush.webp\" alt=\"\" /></p>\n<p>Kamen and Flowers had also emerged victorious. Each team created its robot with its own design. Everybody was engaged in a way they weren’t in classrooms. Not surprisingly, more teams joined every subsequent year. </p>\n<p><img src=\"/static/images/blog/dec09_23/FIRST-logo.webp\" alt=\"\" /></p>\n<p>Why is FIRST one of the fastest growing “sports” in high school? It is fun. And that’s enough.</p>\n<p><img src=\"/static/images/blog/dec09_23/KamenConclusionQuote.jpg\" alt=\"\" /></p>","title":"History of FIRST #2 - Values: Start with Fun","date":"2023-12-09","description":"Tech Support's History of FIRST, #2","thumbnail":"/static/images/blog/dec09_23/Maize_Craze_Logo.jpg"}},"__N_SSG":true}