{"pageProps":{"postData":{"id":"jan12_2024","contentHtml":"<p>Build season has just begun, and Quarry Lane’s robotics team 7419 Tech Support has started making good progress towards their first tournament! January 6th was the 2024 Season Kickoff, and like every year, the team’s rookies planned the Launch Party. A picture of the party can be seen below. It was the perfect way to start out our season and everyone enjoyed themselves. This year’s First Robotics Competition game, presented by HAAS, is called “Crescendo”. The 2024 game requires a robot to be able to intake a disk like foam ring and successfully shoot it into three different scoring areas – the speaker, amp, and trap! At the end of the game, robots will even need to hang off a chain structure! Our first competition is SVR Week 1, on Feb 29th. For the 2024 season, our team will be working on one robot: 7419. Here are a few updates for the week of 1/12!</p>\n<p><img src=\"/static/images/blog/jan12_24/pic0.jpg\" alt=\"\" /></p>\n<p><strong>Hardware</strong></p>\n<p>This week our hardware department has been hard at work. The senior members are working on the swerve base and field elements, while our other members have been busy designing their own prototypes in order to prepare for fabrication. The photo below depicts our diligent team members working on the swerve base, which we will be using for this year’s robot. The swerve base is essential for the robot to be successful in the competition, as it allows the robot to quickly change direction while in motion. </p>\n<p>Our team members have taken up the task of building the field elements. In the photo below, they can be seen prepping the frame of one of the field elements, the speaker, which consists of a subwoofer and an opening which robots must score notes into. They have also begun cutting out the rest of the pieces of the subwoofer so that they can finish building it soon. Additionally, the amp has already been completed, and our members have been testing the shooter prototype on it. </p>\n<p><img src=\"/static/images/blog/jan12_24/pic1.jpg\" alt=\"\" /></p>\n<p>On a different note, the younger members have been working on a multitude of different prototypes. For example, the design of a drivetrain prototype can be seen below. Other than the drivetrain, the designs of many other prototypes such as the intake, shooter, amp and trap outtake, and serializer have also been completed. </p>\n<p><img src=\"/static/images/blog/jan12_24/pic2.jpg\" alt=\"\" /></p>\n<p><strong>Software</strong> </p>\n<p>Right now, our programming members have been hard at work giving new life to our swerve drive, which provides a significant advantage in mobility compared to our traditional tank drive. They have implemented the new Phoenix 6 library, providing enhanced sensor fusion and high frequency odometry to elucidate the accurate state of each module. Other programmers have been working on path-planning, which is essentially a pre-programmed set of directions for the robot to follow during the autonomous period. Path-planning provides a much easier interface to work with in order to set waypoints and pick up game elements effectively during this period. They can be seen testing out the code below. Lastly, programming has also been working on vision, an important part of helping the robot know where it is on the field. In conjunction with sensor input from drivetrain encoders, our members are using custom-vision modules powered by 2 Orange Pi 5 coprocessors. This allows us to have low latency and high resolution vision streams during the match, which is critical for detecting AprilTags accurately. Moreover, vision inputs allow better pose estimation by correcting for any disturbances that might happen on the field. They use PhotonVision, an open-source computer vision platform, to track the location of markers on the field and determine the robot’s position relative to the field in real-time.</p>\n<p>Obtaining high accuracy by combining all of these different sensors, our programmers can generate paths on-the-fly to travel to predetermined positions on the field much more efficiently. At a high level, moving around the field as fast as possible is critical to increasing the amount of cycles our robot performs during a match.</p>\n<p><strong>Business</strong></p>\n<p>For the past week, the business department has been tirelessly planning and preparing for the numerous FIRST Robotics awards that can be won at the tournaments, including the principal award, the Impact award. Our business members have begun drafts for the many prompts that need to be answered for the Impact award. They have also started brainstorming ideas for the Impact award video while reviewing past videos. Furthermore, the members have finished storyboarding for the Offseason Recap video, which will be filmed and eventually uploaded to our team’s very own Youtube channel: <a href=\"https://www.youtube.com/@7419tech\">7419 Tech Support</a>.</p>\n<hr />\n<p>If there are any questions, please email qls7419leadership@gmail.com. Check out our Instagram, 7419tech, for more frequent updates as well as our Youtube channel, 7419 Tech Support, for long form informational videos about our team. Our team is super excited for the season ahead, and we can’t wait to update everyone more in the future!</p>","title":"This Week in FRC - Jan 12, 2024","date":"2024-01-12","description":"Weekly Status","thumbnail":"/static/images/blog/nov04_23/0Logo.svg"}},"__N_SSG":true}