{"pageProps":{"postData":{"id":"FIRST_Teamwork","contentHtml":"<p>Teamwork is a core principle of FIRST Robotics Competitions (FRC). Each year, groups of students around the world design, build, and test their robots, but the biggest challenge is building a team that is greater than the sum of its parts. All teams select leaders, train new members, and divide up work. The elite teams, however, hold a secret. It’s the secret that the founders of FIRST discovered over thirty years ago.</p>\n<p>Renowned inventor Dean Kamen founded For Inspiration and Recognition in Science and Technology (FIRST) in 1989. Two years later Kamen asked MIT robotics professor Woodie Flowers to be his partner. Their partnership changed the world of robotics and education around the globe. </p>\n<p><img src=\"/static/images/blog/oct22_23/KamenFlowers.jpg\" alt=\"\" /></p>\n<p><strong>Dean Kamen starts FIRST</strong></p>\n<p>Dean Kamen is the charismatic inventor of products that have helped millions of patients regain their mobility. Kamen first found his purpose when learned that people who needed constant microdoses of medicine, such as insulin, could not leave the massive machines that administered their medicine. Kamen designed and built a small, wearable device that delivered precise doses of medicine, so patients could leave their homes. Kamen then founded DEKA Research and Development Corp and invented a portable kidney dialysis machine, so those patients could regain their mobility. His iBot, a self-balancing wheelchair, enables patients to move over sand, rocks, and stairs. It can even help the person in the chair “stand” so they can grab objects that are impossible to reach in a traditional wheelchair. Kamen’s Segway has helped tens of thousands of people with mobility challenges resume active lives.  </p>\n<p><img src=\"/static/images/blog/oct22_23/Kamen.jpg\" alt=\"\" /></p>\n<p><img src=\"/static/images/blog/oct22_23/KameniBot.webp\" alt=\"\" /></p>\n<p><img src=\"/static/images/blog/oct22_23/KamenSegway.webp\" alt=\"\" /></p>\n<p>After helping so many people, Kamen wanted to create the inventors of the future.  In 1989, he established FIRST to unleash the creativity of young scientists. He believes that creativity is stifled in classrooms, so he wanted to give students the freedom to build, fail, and try again. He also wanted to counteract the individualistic nature of school by encouraging students to collaborate. He argued, “We justify sports for teamwork but why, when we do it in the classroom, do we call it cheating?\" Kamen believes all great scientific work is done by teams that creatively solve problems, so those became two founding principles of FIRST. </p>\n<p><img src=\"/static/images/blog/oct22_23/FIRST.png\" alt=\"\" /></p>\n<p><strong>Enter Woodie Flowers</strong></p>\n<p>Despite Kamen’s brilliance and passion, FIRST did not take off until he partnered with Woodie Flowers. Professor Woodie Flowers (1943-2019) loved to teach young people how to work together to build engineering solutions that improved the world. The formative event in Flowers’s life occurred when he was seventeen. While driving with three friends, a car struck them head-on at over 100 miles per hour. Three people died. After the tragedy, Flowers developed a \"genetic opposition to violence\" and a \"fierce, vocal loathing of any spectacle that involves crashing pieces of machinery into each other.\" FRC does not allow robots to attack one another because Flowers believed robots should do more than fight. </p>\n<p><img src=\"/static/images/blog/oct22_23/Flowers.webp\" alt=\"\" /></p>\n<p>Professor Flowers was as devoted to robotics as Dean Kamen, but his passion was for teaching. From 1974 - 1987, he taught MIT’s famous 2.70 (now 2.007) course on robotics. Each year, students team up to build a robot to overcome a new challenge. Flowers wanted his students to translate their theoretical knowledge into practical applications, so he gave them a bag of low-cost materials, a challenge, and then let them figure out what to do. He also expected the teams to support one another, even in the heat of battle. He called the act of collaborating during competition “gracious professionalism” and it became a core FRC value. Under Professor Flowers’s guidance, FIRST launched its inaugural robotics competition in 1992, and it has been growing ever since. </p>\n<p><img src=\"/static/images/blog/oct22_23/Flowers270.jpg\" alt=\"\" />\n<img src=\"/static/images/blog/oct22_23/FRC.jpg\" alt=\"\" /></p>\n<p><strong>The Secret to Teamwork</strong></p>\n<p>What secret of teamwork did Dean Kamen and Woodie Flowers discover over 30 years ago? They understood that the best teams unlock the unique strengths of each of their members. Kamen and Flowers did not have the same background, the same passions, or the same skills. Kamen’s charisma brought attention (and corporate sponsorships) and his litany of inventions brought credibility to FIRST. Flowers brought decades of experience in teaching and running robotics competitions for young people. They were different and they embraced those differences, so that the team could achieve more than either could individually. Flowers talked about how Kamen enabled him to bring the ethos of MIT 2.70 to the world. Kamen returned the compliment by crediting Professor Flowers for laying the foundation for FRC, which propelled Kamen’s FIRST vision to become reality. </p>\n<p><img src=\"/static/images/blog/oct22_23/FRC2.jpg\" alt=\"\" /></p>\n<p>Now you know the secret to one of the greatest partnerships in robotics history. A team’s strengths lie in its member’s differences, not in each person being a replaceable cog. So there is only one question left. How will you learn from Kamen and Flowers and build the best possible FIRST team this year?</p>\n<p><img src=\"/static/images/blog/oct22_23/TeamworkQuote.png\" alt=\"\" /></p>","title":"History of FIRST #1 - The Founders' Secret to Teamwork","date":"2023-10-22","description":"Tech Support's History of FIRST, #1","thumbnail":"/static/images/blog/oct22_23/KamenFlowers.jpg"}},"__N_SSG":true}