{"pageProps":{"postData":{"id":"feb14","contentHtml":"<p>With just about two weeks left to go in build season, things are starting to shape up and piece together to ultimately form our robot!</p>\n<p>2022’s game <em>Rapid React</em>&nbsp;challenges us to create a robot that can pick up and shoot cargo into a scoring hub and be able to climb its way up as many as four ascending rungs. With a quick recap of the game, here is what we’ve been finalizing and working on this week!</p>\n<p><strong>Intake:</strong></p>\n<p>The intake is the part of the robot that allows us to collect cargo and score points.&nbsp;Further developing our prototype from last week, we successfully tested out the 4-bar intake design! We used retractable arms to collect the balls and pull them into our loader with two sets of wheels and a screw set to help direct the ball into the center. Now that we have created a draft of our final intake, we can begin configuring it with pneumatics next week.</p>\n<p><img src=\"/static/images/blog/feb14/image1.png\" alt=\"\" /></p>\n<p><strong>Loader</strong></p>\n<p>Connecting the intake to the shooter and allowing us to score, the loader is an essential part of the robot. This week, we created a triangle prism to funnel balls up to the shooter. The triangular beams support the ball and contact it at two points to ensure it makes its way to the shooter in the quickest manner possible.</p>\n<p><strong>Shooter</strong></p>\n<p>With our old design from last week, we have made a few prominent changes to make our shooter better. We will be implementing a turret and limelight to shoot even more precisely. The limelight focuses on strips of reflective tape along the upper hub and is basically a vision system, allowing us to consistently shoot in the same spot and score more points. The turret on the other hand allows the shooter to move freely, and with both the limelight and the turret, we can have an adequate shooter.</p>\n<p>With our mechanical prototypes shaping up nicely, things in the programming team are also starting to get finalized and tested!</p>\n<p><strong>Autonomous Program Testing</strong></p>\n<p>Autonomous code is implemented in the autonomous period, where robots will move on their own without any assistance of the driver. With our code for things such as moving forward, getting one cargo, and moving off the tarmac completed, we can now start testing it to ensure that it runs properly. To set up our testing environment, we have also started taping the floor to mimic the field and accurate measurements.</p>\n<p><img src=\"/static/images/blog/feb14/image3.png\" alt=\"\" /><img src=\"/static/images/blog/feb14/image2.png\" alt=\"\" /></p>\n<p><strong>Website:</strong></p>\n<p>Our website, linked <a href=\"https://www.google.com/url?q=https://www.7419.tech&sa=D&source=editors&ust=1644960643112452&usg=AOvVaw1WVj8Uzx1VYYjNupxxw3Qo\">here</a>, now has a contact us page for any comments, questions, or concerns! Once again, it also has a description of our team history and leadership, socials, and any new developments in our team.</p>\n<p>With all subteams working diligently to meet deadlines and finalize items, we are well on our way to having a finished robot soon! If you have any questions, please do not hesitate to contact the team at support@7419.tech or use our contact page on our website.</p>\n<p>Until next week!</p>\n<p>-QLS 7419’s Media Crew</p>","title":"This Week in FRC","date":"2022-02-14","description":"Tech Support's update for the week of 2/14","thumbnail":"/static/images/blog/feb14/image1.png"}},"__N_SSG":true}