{"pageProps":{"postData":{"id":"jan19_2024","contentHtml":"<p>As a recap, this year’s First Robotics Competition game, presented by HAAS, is called “Crescendo”. The 2024 game requires a robot to be able to intake a disk like foam ring and successfully shoot it into three different scoring areas – the speaker, amp, and trap! At the end of the game, robots will even need to hang off a chain structure! Now, here’s a few updates for the week of 1/19:</p>\n<p><img src=\"/static/images/blog/jan19_24/pic0.jpg\" alt=\"\" /></p>\n<p><strong>Hardware</strong> </p>\n<p>This week our hardware team has been working diligently on creating prototypes for the robot intake. They design, sketch, and use computer-aided design (CAD), and then construct the prototype to test it. The hardware team focusing on testing and refining these prototypes is vital. It is crucial to ensure that the robot's intake works seamlessly for its intended tasks of object manipulation. Through design, sketching, CAD work, and testing we identify any issues and make necessary adjustments before finalizing the build. Additionally, by remodeling the swerve base with wiring and different components, we aim to enhance its capabilities. This attention to detail can result in a versatile robot capable of efficiently navigating various challenges. </p>\n<p><strong>Software</strong> </p>\n<p>Paying attention to the robot's drivetrain is another aspect of the development process. It involves conducting tests and making improvements to the motors and gears to ensure that the robot can move swiftly and effectively. An optimized drivetrain plays a role in determining the overall performance of the robot affecting its speed, maneuverability, and responsiveness. As the software team continues their work it could be interesting to explore how the code for planning paths and the vision program contribute to enhancing the functionality of the robot. Additionally, gaining an understanding of the goals behind improving the drivetrain can provide insights into its intended applications or scenarios where it will excel. The software team's efforts in refining path planning code and incorporating computer vision using Orange Pi demonstrate their commitment to precision and intelligence in how the robot moves. Path planning is particularly critical for tasks involving navigating obstacles or following paths. The meticulous testing and refinement carried out on components of the robot's drivetrain, such as motors and gears highlight how devoted this team is to optimizing its performance. A calibrated drivetrain ensures not only speed and efficiency but also reliability across different scenarios. As progress continues within the software team it would be beneficial to consider how path planning capabilities and vision integration align with earlier hardware developments.</p>\n<p><strong>Business</strong></p>\n<p>Currently, the business department is well underway for preparing for the Impact Award by finalizing the written portions: the executive summaries and the essay. Furthermore, the members are currently filming scenes, voiceovers, and videos for the Impact Video which will be showcased soon on our Youtube! As for our outreach, we are hosting an FTC tournament this weekend! We will be setting up as well as volunteering at the event to provide more opportunities for young FTC teams to compete and gain more experience.</p>\n<p><img src=\"/static/images/blog/jan19_24/pic1.jpg\" alt=\"\" /></p>\n<hr />\n<p>If there are any questions, please email qls7419leadership@gmail.com. Check out our Instagram, 7419tech, for more frequent updates as well as our Youtube channel, 7419 Tech Support, for long form informational videos about our team. Our team is super excited for the season ahead, and we can’t wait to update everyone more in the future!</p>","title":"This Week in FRC - Jan 19, 2024","date":"2024-01-19","description":"Weekly Status","thumbnail":"/static/images/blog/nov04_23/0Logo.svg"}},"__N_SSG":true}