{"pageProps":{"postData":{"id":"MTTD2023","contentHtml":"<p>The members of Quarry Lane School’s Team 7419 are built a little differently, especially when it comes to fun. Spending hours in the workshop, building robots? That’s fun. Conducting weeks of inventory, writing grant applications, and creating graphics? That’s fun, too. Desperately tweaking and fixing robots in the stress of a competition, with little sleep or food, while surrounded by over 40 other teams? That’s the most fun of all. <a href=\"FIRST_Fun\">FIRST says that robotics is “the hardest fun you’ll ever have”</a> and Team 7419 wouldn’t have it any other way.</p>\n<p><img src=\"/static/images/blog/jan06_24/MTTD_Crowd.jpg\" alt=\"\" /></p>\n<p><strong><em>Off-Season Tournament #2 - Madtown Throwdown</em></strong></p>\n<p>After demonstrating our <a href=\"CCC2023\">gracious professionalism at the first off-season tournament</a>, Team 7419 went to Madtown Throwdown from November 10-12. Hosted by MadTown Robotics (Team 1323), this offseason competition in Madera, CA is an annual “final exam” for everything we’ve worked on during the offseason. QLS robotics sent two robots to the tournament, which provided opportunities for even more new members to experience the thrill of competition. \n<img src=\"/static/images/blog/jan06_24/MTTD_Team.jpg\" alt=\"\" /></p>\n<p>Team 7419 passed the test with a best-ever showing at Madtown Throwdown. The competition included 46 robots, 75 qualifying matches, and a 5 round double-elimination playoff. Both QLS robots were 5-5 in their 10 qualifying matches, and one of the robots was selected for the playoffs. The QLS robot won a match in the playoffs before being eliminated by the eventual runners-up. The team’s alliance finished in the top-6 of the tournament!</p>\n<p><img src=\"/static/images/blog/jan06_24/MTTD_Comp.jpg\" alt=\"\" /></p>\n<p>The Madtown Throwdown demonstrates the potential of this year’s team. It all begins with a unified, dedicated team because the path to greatness is in supporting and understanding each other. At Madtown Throwdown, the team truly came together. Everybody saw how the teamwork between hardware, software, and drive team created clean runs in competition. When the team is united, good results follow.</p>\n<p><img src=\"/static/images/blog/jan06_24/MTTD_Teamwork.jpg\" alt=\"\" /></p>\n<p><strong><em>Offseason Review</em></strong></p>\n<p>This was the best offseason in the history of Team 7419. We trained on CAD with OnShape, machined parts both simple and complex, worked on electrical systems, tuned our coding skills, and learned how to be safe. </p>\n<p><img src=\"/static/images/blog/jan06_24/OnShape.png\" alt=\"\" width=\"200\" height=\"160\" /></p>\n<p>Since the First Robotics Competition is about inspiring others, we spent the offseason volunteering in our community with groups such as Shepherd’s Gate, mentoring younger teams in FIRST Tech Challenge and FIRST Lego League, and connecting with other teams at the tournaments. </p>\n<p><img src=\"/static/images/blog/jan06_24/FLL.png\" alt=\"\" width=\"200\" height=\"160\" />\n<img src=\"/static/images/blog/jan06_24/FTC.jpg\" alt=\"\" width=\"200\" height=\"160\" /></p>\n<p>In 7419 Tech, students lead and mentor the next generation to be leaders, so we taught the new members Gracious Professionalism, created processes to hold each other accountable, and helped everybody find their calling whether in hardware, software, business, or media.</p>\n<p><img src=\"/static/images/blog/jan06_24/Notion.png\" alt=\"\" /></p>\n<p>And most importantly, we came together as a team. But training is over. Off-season competitions are behind us. Now it is time to build to a crescendo.</p>\n<p><img src=\"/static/images/blog/jan06_24/Crescendo.png\" alt=\"\" /></p>\n<p><strong><em>2024 Season Kickoff</em></strong></p>\n<p>At the season kickoff party, we saw FIRST launch this year’s competition - Crescendo! This game synthesizes the best of FIRST.  It unites art and STEM by using a musical theme and links the past and present because Crescendo is built from two game design challenges from 2021.</p>\n<p>Crescendo is a multi-layered competition which allows for teams to create innovative strategies and unique robots. It encourages coopertition and gracious professionalism, since teams need to work together during a competition to maximize their points. And as always, consistent with the ethos of FIRST co-founder Woodie Flowers, the goal of the competition is not to fight the other robots, but to achieve the best results possible. </p>\n<p><img src=\"/static/images/blog/jan06_24/GameField.jpg\" alt=\"\" /></p>\n<p>The core element of Crescendo is putting notes (rings) into two main locations - the speaker and the amp. Teams can “amplify” the number of points they earn for putting notes in the speaker by first putting notes in the amp. They can earn even more if they work with the other two teams on their side. Teams can also earn points by putting notes in traps. </p>\n<p><img src=\"/static/images/blog/jan06_24/Ring.jpg\" alt=\"\" width=\"200\" height=\"200\" /></p>\n<p>Like last year, the competition starts with an autonomous (self-driving phase) before proceeding to the longer driver-led phase. Teams score extra points at the end, if they can get their robots to suspend themselves above the ground by hanging on a chain! </p>\n<p>At the kickoff party, Team 7419 already started devising this year's strategy and the plan for building a robot that will represent Quarry Lane School in the FIRST Robotics Competition.</p>\n<p>This season will not be easy. The path will not always be smooth. There will be high notes and low notes.  But we’ll go through it as a team. And that’s what makes FIRST so fun. </p>\n<p><img src=\"/static/images/blog/jan06_24/Team.png\" alt=\"\" width=\"300\" height=\"300\" /></p>","title":"23-24 Team Update #2 - Offseason Fun at MTTD Tournament","date":"2024-01-06","description":"Tech Support's Team Update, #2","thumbnail":"/static/images/blog/jan06_24/MTTD_Crowd.jpg"}},"__N_SSG":true}