{"pageProps":{"postData":{"id":"SVR2024","contentHtml":"<p>The air crackles with electricity (metaphorically - remember we believe in keeping everything safe). There is a taste of metal in everybody’s mouth (from excitement, not from soldering gone wrong). Hearts pound faster, crowds chant louder, and robots practically come to life (technically, during the autonomous phase, they really do come to life). </p>\n<p>That’s right. The FIRST Robotics Competition (FRC) preseason is over and we are now in the competitive season! Quarry Lane’s FRC Team 7419 - T.E.C.H. Support kicked off the season in style at the Silicon Valley Regional Tournament in San Jose, CA from Feb 29 to March 3, 2024. There were 42 teams competing. Most teams were from California, but we met teams from Mexico, Idaho, and Hawaii. </p>\n<p>While the crowds come to watch robots, drivers, and engineers strive to achieve greatness in competition, FRC is about so much more than points scored. The competitions are just as much about teamwork, inclusion of others, impacting the next generation, and having fun while doing it! </p>\n<p><img src=\"/static/images/blog/mar09_24/Fun.jpg\" alt=\"\" /></p>\n<p><strong>Gracious Professionalism</strong></p>\n<p><img src=\"/static/images/blog/mar09_24/Team7419.jpg\" alt=\"\" /></p>\n<p>T.E.C.H. Support met and then exceeded expectations at the Silicon Valley Regional. First, the team won the prestigious Gracious Professionalism Award. The concept of “Gracious Professionalism,” collaboration among teams with respect and kindness, was a fundamental tenet of FIRST co-founder Woodie Flowers. The roots of “Gracious Professionalism” predate FIRST to Professor Flowers’s MIT robotics competitions in the 1970s. In other words, it’s not just at the heart of FIRST, but at the heart of robotics competitions. </p>\n<p>Furthermore, the Gracious Professionalism Award reflects on the contributions of the entire team. Some of the remarkable actions included:</p>\n<ol>\n<li><p>Helping other teams with hardware and advice - always giving them the respect they deserve. </p></li>\n<li><p>Helping the pit administrators at the competition. </p></li>\n<li><p>Creating a safety supply map and database to help everybody</p></li>\n<li><p>Involving the kids at the competition in activities to inspire the future generations. </p></li>\n</ol>\n<p><img src=\"/static/images/blog/mar09_24/kids.jpg\" alt=\"\" /></p>\n<ol start=\"5\">\n<li>Bringing unparalleled energy and enthusiasm in the stands - not just for our team, but for the competition itself.</li>\n</ol>\n<p>Gracious Professionalism isn’t just something that we do. It’s who we are. </p>\n<p><img src=\"/static/images/blog/mar09_24/TeamPhoto.jpg\" alt=\"\" /></p>\n<p><strong>Competition</strong></p>\n<p>Over a three day span, T.E.C.H. Support competed in 11 qualifying matches. Each match is an opportunity to learn and grow, but it also places enormous stress on the team. The drivers have to be at the top of their game, even under intense pressure and exhaustion. Furthermore, with 11 matches, the robot needs constant tuning, fixing, and updating. After those 11 matches, the team was ranked 13 out of 42 teams! Not surprisingly, Team 7419 made the playoffs, forming a three team alliance with Team 2288 Hydra from Vacaville, and Team 2367 from Mountain View. The team won a match in the playoffs, but was eventually eliminated in an exciting match. </p>\n<p><img src=\"/static/images/blog/mar09_24/Playoffs.jpg\" alt=\"\" /></p>\n<p>Making the semifinals was an amazing start to the season, and the lessons learned will propel the team to even greater heights in subsequent competitions. First, as with everything in the modern world, we learned how important data is. Data about our robot, the other robots in the competition, and about what is working. We are working on gathering and analyzing even more data so that we can make better decisions, follow better strategies, and enjoy better results. Second, we learned how to better scout. While most people think of scouting as focusing on how to beat the competition, we realized that it is just as important to understand what teams best complement our strengths and weaknesses. Since the competition is based on three-team alliances, it is critical to maximize the strength of every team that is on our team in the playoffs. </p>\n<p><img src=\"/static/images/blog/mar09_24/Robot.jpg\" alt=\"\" /></p>\n<p><strong>Conclusion</strong></p>\n<p>The season is just beginning. We’ve already achieved amazing results, but we can do so much more. We’ll next be competing in Tempe Arizona from March 20-23rd, and at Berkeley HS April 4th-7th. Nobody can guarantee the results, but you can bet that Team 7419 will continue to display Gracious Professionalism, compete hard, and learn every single match. Because once you taste the thrill of the competition… you just want more!</p>\n<p><img src=\"/static/images/blog/mar09_24/WoodieQuote.jpg\" alt=\"\" /></p>","title":"23-24 Team Update #3 - Gracious Professionalism at SVR Tournament","date":"2024-03-09","description":"Tech Support's 23-24 Team Update, #3","thumbnail":"/static/images/blog/nov04_23/0Logo.svg"}},"__N_SSG":true}