{"pageProps":{"postData":{"id":"FIRST_Impact","contentHtml":"<p>Impact is about doing something that matters. It requires innovation, hard work, and, most importantly, changing somebody’s life. </p>\n<p>Prior to founding FIRST, <a href=FIRST_Teamwork>Dean Kamen and Professor Woodie Flowers</a> had impacted people’s lives with their inventions and their teaching. They both aspired to make an even greater impact. They wanted to build an organization that would live beyond them to impact future generations. Impact is one of FIRST’s core values, and you can feel it in everything FIRST does.</p>\n<p><img src=\"/static/images/blog/jan27_24/values.png\" alt=\"\" /></p>\n<p><strong>FIRST Alumni</strong></p>\n<p>FIRST has made an indelible impact on its alumni. </p>\n<p><img src=\"/static/images/blog/jan27_24/Deanna.png\" alt=\"\" /></p>\n<p>DeAnna Kinds from Chicago said that FIRST helped her “come back to life” after challenges at home had caused her to disengage. She graduated from college and now has her dream job. She is expanding her impact by pulling other underrepresented children into the FIRST.  </p>\n<p><img src=\"/static/images/blog/jan27_24/Eduardo.png\" alt=\"\" /></p>\n<p>Eduardo Pineda from Monterrey, Mexico had little hope for his future until he found FIRST. He says that “FIRST was the place where I belonged” and it inspired him to pursue a career in engineering. He is increasing his impact by becoming a FIRST mentor. </p>\n<p><img src=\"/static/images/blog/jan27_24/Elisa.jpg\" alt=\"\" /></p>\n<p>Elisa Moore from Raleigh said that FIRST helped her develop her leadership and presentation skills. Since FIRST Robotics Competitions (FRC) are about more than just the robots, she learned how to connect with other teams and present to the judges. Now she is pursuing a career in international relations. She wants to make an impact by bringing peace to the world. And, of course, she is mentoring multiple FIRST teams.</p>\n<p>There are thousands of stories about the impact FIRST has made on its alumni, which is inspiring. What is more impressive, however, is that each of their stories includes how they want to spread that impact even wider. </p>\n<p><strong>Scholarships</strong></p>\n<p>Companies, foundations, and businesses all need people who can make an impact. They need brilliant students who will work with others to find innovative solutions to the world’s most pressing problems. FIRST participants have the passion to make an impact, but they need the opportunity to get an education. As Dean Kamen said, “I think an education is not only important, it is the most important thing you can do with your life.” </p>\n<p>FIRST makes an impact on its members by connecting students and to institutions that offer scholarships. In 1996, Worcester Polytechnic Institute (WPI) created the first scholarship for FIRST members. Just 4 years after <a href=FIRST_Fun> the initial FIRST Robotics Competition</a>, the school was inspired by the <a href=FIRST_Teamwork> teamwork </a> and passion of the FIRST competitors, and they wanted to give them a chance to make an even bigger impact on the world. As one of the scholarship recipients explained, “The FIRST Scholarship Program enabled me to attend the best engineering institution in the country; a feat that would have been a pipe dream otherwise.” FIRST and WPI transformed his life.</p>\n<p><img src=\"/static/images/blog/jan27_24/WPI.png\" alt=\"\" /></p>\n<p>Today, over <a href=https://www.firstinspires.org/alumni/scholarships> 140 institutions</a> offer college scholarships to participants in FIRST. WPI itself offers two different scholarships. Some institutions offer up to 100 different scholarships for FIRST team members. </p>\n<p><img src=\"/static/images/blog/jan27_24/Scholarships.png\" alt=\"\" />\nInspiration is contagious. FIRST inspires students to reach beyond their limits. The students inspire organizations to provide opportunities through scholarships. And those students come back and inspire the next generation. The impact of FIRST creates a positive feedback loop.</p>\n<p><strong>Dr. Bart Kamen Memorial FIRST Scholarship</strong></p>\n<p><img src=\"/static/images/blog/jan27_24/BartKamen.jpg\" alt=\"\" /></p>\n<p>FIRST offers an inspirational scholarship that is all about making an impact. Dr. Bart Kamen, FIRST founder Dean Kamen’s older brother, inspired everybody around him. Dean Kamen’s first invention was inspired by a problem that his brother brought to him. Bart, then a medical student, was frustrated that people who needed frequent microdoses of medicine, such as insulin, were virtual prisoners of the enormous machines that delivered the injections. In response, Dean built a small wearable device that gave people the freedom to move again. The invention made an impact on the lives of millions of people.</p>\n<p>Dr. Bart Kamen also inspired people in the medical community. In addition to spending over three decades teaching, he was a leading cancer researcher, with a focus on pediatrics. He was a staunch believer in the Hippocratic Oath - doing what is best for the patient and the family. Even as a researcher, his intent was to deliver solutions that would help cancer patients - physically and emotionally - because that would create the maximum impact. He used his humor and disease to make a lasting impact on the world. His 2011 TED Talk about his own struggles with a rare tumor exposed the challenges of both doctor and patient when dealing with rare diseases. His story still resonates with doctors a decade later.</p>\n<p><img src=\"/static/images/blog/jan27_24/KamenTED.jpg\" alt=\"\" /></p>\n<p>In addition to his work in the medical community, Dr. Bart Kamen was an avid volunteer with FIRST. He understood the role that technology and robotics could play in medical treatment, and wanted to inspire students to pursue their passion in biotechnology. He also frequently stated that, like engineering, “medicine is an art.” Solutions were not going to be found in textbooks, processes, and incremental enhancements. He needed students that would follow their inspiration to try something completely new. Dr. Kamen never stopped advocating for creativity in robotics and medical science because he knew that innovation would create an impact that would change the world.</p>\n<p>To honor Dr. Kamen after his tragic death in 2012, FIRST introduced Dr. Bart Kamen Memorial FIRST Scholarship. This scholarship is for FIRST participants who are intending to earn biomedical engineering or pre-medical degrees. Since 2013, FIRST has recognized four exceptional students every year. Some of these students have already made an impact on the world. \n<img src=\"/static/images/blog/jan27_24/KamenScholarship.png\" alt=\"\" /></p>\n<p><strong><em>Dr. Sarah Rudasill</em></strong> is the General Surgery Resident Physician at Massachusetts General Hospital.</p>\n<p><strong><em>Dr. Sofia Dhanani</em></strong> practices Pediatrics and Child Neurology for Stanford Children's Health</p>\n<p><strong><em>Dr. Tyler Hanna</em></strong> is a Resident Physician at Connecticut Children’s Hospital.</p>\n<p><strong><em>Patrick Demkowicz</em></strong> is doing medical research into glaucoma and other degenerative eye conditions at Yale</p>\n<p><strong><em>Vishnu Rachakonda</em></strong> is helping people with serious mental illness</p>\n<p><strong><em>Sreekar Mantena</em></strong> is conducting research into Parkinson’s Disease and Eye diseases</p>\n<p>In just one decade, Dr. Kamen’s scholarship has helped students make an impact on the world of medical science and in their patients’ lives. </p>\n<p><strong>Conclusion</strong></p>\n<p>Impact requires hope, opportunity, and action. FIRST members hold boundless dreams for the future, have hundreds of scholarship opportunities, and are already turning their dreams into reality. And the best part is - anybody can participate.</p>\n<p><img src=\"/static/images/blog/jan27_24/Impact.jpg\" alt=\"\" /></p>","title":"History of FIRST #3 - Values: Make an Impact","date":"2024-01-27","description":"History of FIRST, #3","thumbnail":"/static/images/blog/jan27_24/BartKamen.jpg"}},"__N_SSG":true}