{"pageProps":{"postData":{"id":"ComputerIsTheMedium","contentHtml":"<p>AI art generation tools such as Dall-E and Midjourney have led people to ask - “Is somebody who creates AI-generated images an ‘artist’?” It is not the first time that the art world has raised questions about the use of computers in the process of creating art. There have been concerns about the use of CGI (computer generated imagery), digital photography, and even electronic lights. In the 1960s, artists debated whether art must be created in a traditional medium such as paint, pencil, or crayon. Three engineers/artists, Michael Noll, Bela Julesz, and Vera Molnar, proved that the computer was an artistic medium and legitimized digital art.</p>\n<p><strong>Michael Noll - Pioneering Digital Art</strong></p>\n<p>Michael Noll was a pioneer of digital art. Noll was trained as an engineer, but his passion was in connecting humans and machines. In his first fifteen years at Bell Labs, Noll worked on computer graphics, haptic response, and speech recognition. Noll’s journey to becoming a digital artist began with an accident. In 1962, an intern working on computer graphics made a simple coding error. The result was an haphazard line plot which looked like modern art to Noll. He realized that, while the purpose of most programs is to produce predictable results, the introduction of randomness could lead to the creation of true art.</p>\n<p><img src=\"/static/images/blog/nov18_23/NollPhoto.jpg\" alt=\"\" /></p>\n<p>At first, Noll focused on the basic algorithms for creating digital images. As with any art student, he wanted to master the fundamentals before introducing his creative twist. He spent two years creating programmatic libraries that analyzed existing artworks and created faithful variants of those works. Since computers had limited capabilities, Noll chose to emulate the works of Piet Mondrian, the Dutch painter who created abstract geometric art. Noll showed his recreation of Mondrian’s “Composition With Lines” to over 100 art critics. Most of them believed it was an authentic Mondrian.</p>\n<p><img src=\"/static/images/blog/nov18_23/Mondrian-Composition.webp\" alt=\"\" />\n<img src=\"/static/images/blog/nov18_23/Noll-Composition.webp\" alt=\"\" /></p>\n<p>Confident that he was able to reproduce existing art, Noll then unleashed his creativity. He deliberately introduced randomness to the algorithms that generate the images. As he experimented, he created some “rules of digital art”:</p>\n<ol>\n<li><p>Structure - There must be a fundamental underlying structure because complete randomness is uninteresting chaos</p></li>\n<li><p>Mathematics - The underlying structure should be provided by equations such as Gaussian functions because they can adapt to fit different sizes and densities of digital screens</p></li>\n<li><p>Randomness - The randomness should be introduced into the equation rather than separate, so that there is an organic nature to the composition</p></li>\n</ol>\n<p>Noll demonstrated that he could create art with randomized algorithms on computers, just like others created art with oil paint on canvas. The computer could be the medium.</p>\n<p><img src=\"/static/images/blog/nov18_23/NollArt.jpg\" alt=\"\" /></p>\n<p><strong>Bela Julesz - Bringing the Third Dimension to Digital Art</strong></p>\n<p>Bela Julesz leaned into the interaction between human perception and digital art to revolutionize both the understanding of vision and art. Julesz was both a psychologist and computer scientist and his focus was on human visual perception. Like Noll, Julesz worked at Bell Labs. During his work on understanding how stereoscopic vision works, Julesz invented the “random-dot stereogram.” When viewed with only one eye, it appeared to be a random sequence of dots. When viewed through both eyes, it revealed an image with three-dimensional depth. Over time, the “random-dot stereogram” evolved into the autostereogram, or “Magic Eye picture”, in which the viewer can discover a “three dimensional” image “hiding” in a forest of dots. Julesz and Noll collaborated to create digital art, and they even had an art show in New York City in 1964. </p>\n<p><img src=\"/static/images/blog/nov18_23/Béla_Julez.jpg\" alt=\"\" /></p>\n<p>Julesz’s research on stereoscoping vision was as revolutionary as the discovery of perspective in traditional paintings. It enabled digital artists to create images with the illusion of depth on the limited canvas of computer displays. As Noll had done, Julesz demonstrated that the computer could be a medium for art, this time in three dimensions. </p>\n<p><img src=\"/static/images/blog/nov18_23/stereogram.jpg\" alt=\"\" />\n<img src=\"/static/images/blog/nov18_23/AutoStereogram.png\" alt=\"\" /></p>\n<p><strong>Vera Molnár - Revolutionizing Art from the Inside</strong></p>\n<p>Unlike Michael Noll and Bela Julesz, Vera Molnár was a traditional artist, but she was drawn to the potential of digital art. In the 1950s, Molnár created non-representational paintings, abstract art that does not depict the real world. Since her work was similar to Mondrian’s, it is not surprising that she was inspired by Michael Noll’s work. In fact, Molnar learned to program in Fortran and Basic, so that she could create digital art. </p>\n<p><img src=\"/static/images/blog/nov18_23/vera-molnar.webp\" alt=\"\" /></p>\n<p><img src=\"/static/images/blog/nov18_23/Molnar-early.jpg\" alt=\"\" /></p>\n<p>Once she was able to implement simple algorithms, Molnár devised her own approach to digital art. She would create a basic algorithm and then introduce a variety of random modifications to the algorithm. Molnár’s speciality was creating loops that subtly perturbed the underlying algorithm. She would introduce operations that rotated, deleted, or moved part of the drawing that had already been created. Whereas both Noll and Julesz spent most of their time designing the mathematical algorithms for their images, Molnár preferred trial and error. Therefore, she admitted that she discarded most of the images, saying, “Of 100 pieces, we might keep one.” </p>\n<p><img src=\"/static/images/blog/nov18_23/MolnarDigital.webp\" alt=\"\" /></p>\n<p>By bringing the credibility of an artist and a different approach to digital art, Molnár helped bring digital art into the mainstream. Still, she had to fight battles with the art community. Peers even complained that she had “dehumanized art.” Despite the criticism, Molnár persisted in demonstrating that the computer can be the medium for art, with the ability to rapidly produce and discard works until it matches the artist’s vision… which is the same argument AI generated art users make today. </p>\n<p><strong>Conclusion</strong></p>\n<p>Art and technology are both always evolving. <a href=Computer_Art_1950s>Artists and engineers in the 1950s </a> collaborated to improve what they were already doing. They used machines to enhance their art, and used art to push their machines to the limit. In the 1960s, Michael Noll, Bela Julesz, and Vera Molnár revolutionized their fields by demonstrating that computers were not just a tool. They were a new medium for creating art. They transformed the world by making the computer into an artistic medium.</p>\n<p><img src=\"/static/images/blog/nov18_23/Conclusion.jpg\" alt=\"\" /></p>","title":"Technology and Art #4 - The Computer is the Medium - 1960s","date":"2023-11-18","description":"Tech Support's Technology and Art, #4","thumbnail":"/static/images/blog/nov18_23/NollWork.png"}},"__N_SSG":true}