{"pageProps":{"postData":{"id":"Blendo","contentHtml":"<p>“It was a piece of steel the size of a fist traveling at the speed of sound.” </p>\n<p>Some robots <a href = DonCucoelGuapo> \ninspire us</a>, others <a href= Robodoc> heal us</a>, and still others <a href= Brooks> simplify our lives</a>. Sometimes, though, robots are just pure, destructive, chaotic fun. In the 1990s, robot battles became an international sensation, and no robot was more fun than Blendo. The simple robot was so dangerous that judges asked it to withdraw from two Robot Wars tournaments. Blendo is a perfect example of what can happen when creativity meets competition.</p>\n<p>In the 1990s, robot battles went mainstream. The technology was widespread enough that hobbyists could build functional robots, and inexpensive enough that they could afford to destroy each other. “Critter Crunch” was the first well-known competition, and it began as a sideshow during comic conventions. The robots’ bodies had to be less than one cubic foot and weigh less than 20 pounds because they fought on a standard flip-out table. The robots and weapons were primitive, but the idea caught on. </p>\n<p><img src=\"/static/images/blog/mar15_23/CritterCrunch.jpg\" alt=\"\" /></p>\n<p>By the late 1990s, the BBC launched the Robot Wars TV series in the United Kingdom. With greater investment, the battles now took place in an arena, so the robots were bigger, heavier, and more destructive. </p>\n<p><img src=\"/static/images/blog/mar15_23/RobotWarsPoster.jpg\" alt=\"\" />\nA robot could win a battle in one of four ways:</p>\n<ol>\n<li><p>Disable the other robot</p></li>\n<li><p>Launch the robot out of the arena </p></li>\n<li><p>Push the robot into the “Pit of Oblivion,” a hole in the center of the arena</p></li>\n<li><p>Judge’s decision (if time expired) - based on aggression, damage, control, and style </p></li>\n</ol>\n<p>While the matches were always competitive, the community was collaborative, exhibiting the gracious professionalism to which we all aspire. </p>\n<p><img src=\"/static/images/blog/mar15_23/RobotWarsArena.jpg\" alt=\"\" /></p>\n<p>Within the battle robots, however, Blendo stands out for its design for ruthless demolition. Blendo was built by Jamie Hyneman and Adam Savage, who later achieved fame as the hosts of the Mythbusters TV series. Their design was exceptionally simple. For the body, Hyneman and Savage attached two blades to an old wok. The robot then attacked by spinning around, slashing at anything near it with the blades. They powered the robot with a lawnmower engine. The robot was a crude tool of destruction - a spinning half-sphere with blades that rotated at 500RPM (80 miles per hour). </p>\n<p><img src=\"/static/images/blog/mar15_23/Hyneman.jpg\" alt=\"\" /></p>\n<p>Blendo also reveals the technological limitations of its time. For example, there Blendo did not have a simple way to turn on/off. Hyneman inserted a power drill into a small hole in Blendo to jump start the motor to make Blendo spin, so he had to stand dangerously close to a killer robot to start the blades spinning at 80mph. Then, if the motor died in the match, there was no way to restart it. Since the motor was so large, they could have only one. Therefore, if the motor died, the entire robot shut down - it could not spin or move. </p>\n<p><img src=\"/static/images/blog/mar15_23/Blendo_Power_Drill_start.webp\" alt=\"\" /></p>\n<p>In the mid-1990s, robot designers simply did not have access to tools we take for granted today. For example, CAD (Computer Aided Design) software was expensive and complicated. As a result, all the robots had basic shapes - cubes, cylinders, or half-spheres. Lithium batteries were not available, so the robots had massive batteries with limited charge. Telemetry was almost non-existent, since cameras and lasers were so expensive. Even surge protection was new, so robots routinely exploded. With so many challenges just getting the robots working, safety features were almost unheard of. Considering the limitations, the early robots were truly marvels of engineering and ingenuity. </p>\n<p><img src=\"/static/images/blog/mar15_23/Blendo.png\" alt=\"\" /></p>\n<p>Blendo also demonstrates how quickly robotic technology evolves. In the 1995 Robot Wars competition, Blendo was so dominant that the judges asked it to withdraw from the event. Blendo was literally spraying broken pieces of its opponents outside the arena, so it was declared the Heavyweight Champion. In 1997, despite giving opponents two years to advance and the arena two years to become more secure, Blendo had to withdraw again for safety reasons. It was given a special award for being so destructive and dominant. </p>\n<p><img src=\"/static/images/blog/mar15_23/BlendoBattle.gif\" alt=\"\" /></p>\n<p>Within two years, however, Blendo was obsolete. It lost every BattleBots fight in the late 1990s because it was slow, hard to control, and frequently had motor failures. The opponents improved their armor, developed better mobility, and formulated strategies to defeat single-purpose bots like Blendo. </p>\n<p>Robotics has a place for everybody. Blendo shows that you do not need expensive 3D printers, advanced software tools, or top of line components to make a robot that brings joy and awe to everybody around you. Made out of a wok, a lawnmower motor, and some blades, Blendo tore apart the competition and carved its name into the history books. Blendo proves that a robotics engineer just needs creativity, desire, and an opportunity to compete.</p>\n<p><img src=\"/static/images/blog/mar15_23/Innovation.jpg\" alt=\"\" /></p>","title":"History of Robotics #9 - Blendo - Beauty in Destruction","date":"2023-03-15","description":"Tech Support's History of Robotics, #9","thumbnail":"/static/images/blog/mar15_23/Blendo.png"}},"__N_SSG":true}