{"pageProps":{"postData":{"id":"Sojourner","contentHtml":"<p>In 1997, a metal pyramid surrounded by airbags slammed into the surface of Mars carrying a robotic rover that resembled a microwave on wheels. NASA’s budget for the Mars Pathfinder mission was low, and the expectations were even lower. Once on Mars, however, the Sojourner rover revitalized the world’s interest in space travel. Sojourner demonstrated that a robot does not need to be expensive to succeed; it just needs to work.</p>\n<p><img src=\"/static/images/blog/feb8/1.gif\" alt=\"\" /></p>\n<p>In the 1990s, NASA’s budget was flat or cut every year. With limited funds, they focused on space shuttle trips to the International Space Station. Still, NASA’s scientists wanted to explore, so the Mars Pathfinder mission was born. On July 4, 1997, the pyramid-shaped Pathfinder module dropped on Mars carrying the Sojourner rover. Named after Sojourner Truth, a slave who escaped to become an abolitionist and women's rights activist, Sojourner truly was the size of a microwave. It weighed 25 pounds and was only 25 inches long and 11 inches high. Despite its diminutive size, it explored the surface of Mars for 84 days, taking hundreds of pictures and analyzing rocks. Most importantly, Sojourner laid the foundation for the more expansive Mars missions that followed. </p>\n<p><img src=\"/static/images/blog/feb8/2.jpg\" alt=\"\" /></p>\n<p>Robotics teams know that budget is one of their biggest challenges. We cannot just buy all premium parts; we have to use our ingenuity. The NASA engineers who designed Sojourner faced the same challenges. With limited money available, Sojourner had to be built on a budget. The team identified the most important area in which to invest - mobility - and solved the other challenges with whatever resources they had left.</p>\n<p>First, they had to figure out how to land Sojourner on Mars. Rather than a fancy design, the Pathfinder Lander was a pyramid shaped shell of metal that deployed massive airbags as it plummeted to the ground. Fortunately, the structure held when it hit Mars. Inside, Sojourner was suspended by three stainless steel cables. Although the design was reminiscent of a junior high contraption to land an egg without cracking, it worked.</p>\n<p><img src=\"/static/images/blog/feb8/3.jpg\" alt=\"\" /></p>\n<p>Second, Sojourner had to function in the cold of Mars, which could reach -80 to -110 degrees Celsius. To save money, the actuators were evolved from commercial components designed for use in cold areas of Earth, instead of being custom-designed. Then, they stored the computer components in an insulated box that received the waste heat of the robot. By recycling its own heat, Sojourner protected its sensitive components from the cold. </p>\n<p>Third, they solved the challenge of powering Sojourner by sacrificing performance. A small solar panel produced 16W of power, so Sojourner was designed to consume only 10W while operating. The tradeoff was that its top speed was only 24 meters per hour. Still, Sojourner’s 84 days of operation demonstrated the value of trading performance for power.</p>\n<p><img src=\"/static/images/blog/feb8/4.jpg\" alt=\"\" /></p>\n<p>Fourth, Sojourner needed to be able to detect obstacles. While Moravec’s 3D Occupancy Grid Mapping was state of the art, they could not afford all the components and extra computing power. Instead, Sojourner’s autonomous driving depended on a combination of an external map generated by the Pathfinder lander’s on-board camera, Sojourner’s internal odometry, and a laser for basic obstacle detection. Meanwhile, each night mission control on Earth would connect by modem to issue any manual course corrections to the autonomous movement during the day. Rather than deploying millions of dollars of hardware and designing next generation Artificial Intelligence, the Sojourner team built a heuristic-based system with human oversight. It was cheaper, easier, and proved to be reliable. </p>\n<p><img src=\"/static/images/blog/feb8/5.jpg\" alt=\"\" /></p>\n<p>Finally, Sojourner needed to move around on an unknown surface. This is where the robotics team chose to invest the most money. They designed a 6-wheeled rocker-bogie that used rotating joints instead of springs. Six-wheeled vehicles can climb obstacles three times larger than four-wheeled vehicles can, and can even go at a 45 degree angle without falling, so the extra wheels were extremely valuable for a rocky surface. By using rotating joints on independently actuated and geared wheels, rather than springs, it was able to move across uneven terrain and dusty pockets of land. The front and rear wheels even had independent steering, which provided the smallest turning radius, in case it got trapped in a tight place. Even then, however, the scientists landed Sojourner at Ares Vallis because it was  the most flat, safe place on Mars that they could find.</p>\n<p><img src=\"/static/images/blog/feb8/6.jpg\" alt=\"\" /></p>\n<p>With so many quick “hacks” most commentators said Sojourner would completely fail. Even the most optimistic projections said that Sojourner would not function after even a few hours. </p>\n<p>Sojourner exceeded all expectations. It ran for 84 days, which was 12 times longer than the 7 day mission plan. In that time, it traveled over 100 meters, sent back more than 550 pictures of Mars and used a spectrometer to analyze elements inside the rocks. </p>\n<p><img src=\"/static/images/blog/feb8/7.jpg\" alt=\"\" /></p>\n<p>More importantly, Sojourner captured the world’s imagination. It practically originated the phrase “broke the Internet” in 1997 because so many people were trying to download Sojourner’s images from NASA’s website. In less than 3 months, Sojourner showed the potential of the Internet, demonstrated that interplanetary travel could still capture the public’s imagination, and proved that automated robots could explore other planets. </p>\n<p><img src=\"/static/images/blog/feb8/8.jpg\" alt=\"\" /></p>\n<p>It can be easy to forget that Sojourner paved the way for the better funded, more recent missions to Mars. In the past twenty years, Mars rovers have been more glamorous, more impressive, and, of course, more expensive. The solar-powered rovers, such as Spirit and Opportunity, covered impressive distances at high speed. The nuclear-powered rovers, including Perseverance and Curiosity, are powerful trucks that are  covered in high-end cameras and equipment. Still, as you see modern rovers cruise around Mars like an SUV in a suburb, remember the little microwave on six wheels that started it all.</p>\n<p><img src=\"/static/images/blog/feb8/9.jpg\" alt=\"\" /></p>\n<p>Sojourner showed that a robot does not need to be elegant, expensive, or enormous to achieve great things. The team worked within its constraints, identified what mattered most, and made it work. In the end, that’s all that mattered. </p>\n<p><img src=\"/static/images/blog/feb8/10.jpg\" alt=\"\" /></p>","title":"History of Robotics #5 - Sojourner Defies Expectations","date":"2023-02-08","description":"Tech Support's History of Robotics, #5","thumbnail":"/static/images/blog/feb8/1.gif"}},"__N_SSG":true}