{"pageProps":{"postData":{"id":"jan31","contentHtml":"<p>This past week has been fun, riveting, and so, so productive for all members of Quarry Lane’s 7419 Tech Support! At our weekly general meetings, we reflected on the state of the team and made internal changes to better equip us for the challenges that the FRC program presents.</p>\n<p><img src=\"/static/images/blog/jan31/image6.jpg\" alt=\"\" /></p>\n<p>Presented by The Boeing Company, 2022’s game, <em>Rapid React,</em>&nbsp;challenges us to create a robot that can pick up and shoot cargo into a scoring hub and be able to climb its way up as many as four ascending rungs. Without further ado, here are a few highlights of what we’ve been working on!</p>\n<p><strong>Intake Prototype</strong></p>\n<p>The intake is the part of the robot that allows us to collect cargo and score points. We tested the wooden prototype of the intake and found with much delight that it is quick and accurate. To meet specific criteria in the game manual, we designed a 4 bar mechanism that uses a &nbsp;pneumatic system to extend the intake.</p>\n<p><img src=\"/static/images/blog/jan31/image1.jpg\" alt=\"\" /></p>\n<p><strong>Shooter Prototype</strong></p>\n<p>The shooter mechanism takes the cargo collected by the intake to shoot it into the targets. Highlights of the shooter include the frame and flywheels. The frame holds the electrical board, which contains the wiring for all major mechanisms of the robot. Our shooter design uses two flywheels to propel the ball, as this gave us the best results during testing. The wheels compress the balls to increase speed and guide the cargo as it gets shot out.</p>\n<p><img src=\"/static/images/blog/jan31/image5.jpg\" alt=\"\" /></p>\n<p><strong>Hangar Prototype</strong></p>\n<p>In the last 30 seconds of the game, each team is challenged to hang their robot onto a rung and move to a higher rung, similar to climbing ascending monkey bars. To allow us to get a visual idea of how it would work on the robot and how it would look overall, we created a scaled-down model of the hanger. We also built a field model of the hangar to test out future designs for the hanging mechanism next week.</p>\n<p><img src=\"/static/images/blog/jan31/image4.jpg\" alt=\"\" /></p>\n<p>Beyond the physical developments of our robot, the programming team is hard at work juggling the code for the robot and updating the website.</p>\n<p><strong>Elevator with Limit Switches</strong></p>\n<p>Limit switches make sure things do not extend too far or surpass their limit and in this case, we implemented them with the elevator. With the two limit switches placed on the top and the bottom of the elevator, they can help stop the elevator to make sure it does not extend too far or break the elevator altogether.</p>\n<p><strong>Our team website</strong>, linked <a href=\"https://www.7419.tech\">here</a>, contains a description of our team history and leadership, contact info, and any new developments in our team. We have been updating descriptions and implementing an “Our Robot” page to allow anyone to look and understand our robot in detail, so watch out for that!</p>\n<p><strong>Outreach Highlight of the Week: Push Cart Derby with Boys Scouts</strong></p>\n<p>On January 31st, we attended a push cart derby hosted by Troop 941. Troop 941 used this event to help gain new scouts and introduce them to their troop. At the derby, we showcased our 2021 robot. We started off with showing a slideshow composed of pictures of our season so far and drove our robot through the course. True to the helpful and enthusiastic spirit of FIRST robotics, our pit crew helped another patrol fix a part of their push cart and we were all very happy to be there. It was an enriching and exciting experience for both us as a team and Troop 941!</p>\n<p><img src=\"/static/images/blog/jan31/image3.png\" alt=\"\" /><img src=\"/static/images/blog/jan31/image2.png\" alt=\"\" /></p>\n<p>With tournaments just around the corner, we are prepared to work even harder, since we will be shifting away from tinkering with prototypes to finalizing and fine-tuning our robot.</p>\n<p>If you have any questions, please do not hesitate to contact the team at <a href=\"mailto:support@7419.tech\">support@7419.tech</a>.</p>\n<p>Until next week!</p>\n<p>Written by: Kelly Wu, Rachelle Wang, Sarp Gursel, Verain Mahajan, Ridhima Motewar, Vivi Cheng, Shravan Arumugam, &amp; Brigitte Chung</p>","title":"This Week in FRC","date":"2022-01-31","description":"Tech Support's update for the week of 1/31","thumbnail":"/static/images/blog/jan31/image6.jpg"}},"__N_SSG":true}