{"pageProps":{"postData":{"id":"Robodoc","contentHtml":"<p>What do a veterinarian, orthopedic surgeon, IBM robot scientist, and UC Davis researchers have in common? </p>\n<p>RoboDoc. </p>\n<p>In 1992, four diverse groups of people came together to create RoboDoc, the first robot to operate on a human patient in the United States. The strength of their team was that they had so little in common. Their different skills and perspectives revolutionized both robotics and medicine. The RoboDoc team showed that diversity and connecting across disciplines will accelerate innovation. </p>\n<p>In the mid-1980s, most robotics work was either purely theoretical or completely practical. Researchers at universities were trying to create mobile robots - the evolution of <a href=Shakey>Shakey</a>. Companies were building incrementally better industrial robot arms - the evolution of <a href=Unimate>Unimate</a>. Academia and industry did not know what other problems that robots could solve.</p>\n<p>At the same time, patients who had hip and knee replacement surgeries were struggling with their recoveries. Most patients had to undergo multiple additional surgeries to correct problems from their first surgery. Then, implants had to be replaced every ten to twenty years. Even after successful procedures, patients were in constant pain. The medical community did not know how to improve major joint replacement surgeries.</p>\n<p><img src=\"/static/images/blog/feb22_23/Hip.jpg\" alt=\"\" /></p>\n<p>In 1986, Dr. William Bargar, an orthopedic surgeon, met Howard Paul, a veterinarian who had done hundreds of canine hip replacements. They agreed that the biggest challenge with joint replacement was the imprecision of the surgery. Whether human or canine, they would use a 2D X-ray to plan the operation and design the replacement joint. Then, on the day of the operation, the surgeon would drill a hole into the femur and insert the implant. Since there were always gaps between the implant and hole, they would fill it in with “bone cement” just like a brick layer does with regular cement. The friction caused by the bone cement hurt the patient and degraded the implant. Joint replacement surgeons needed a more precise way to drill into bones. </p>\n<p><img src=\"/static/images/blog/feb22_23/Bargar.jpg\" alt=\"\" /></p>\n<p>Bargar theorized that a robot could create the perfect-sized hole, so that the implant would fit perfectly and require no cement. Bargar and Paul first approached Russell Taylor at IBM Research, where he was creating AML (A Manufacturing Language) to make it easier to program robot arms for assembly line tasks. Taylor saw an opportunity to solve an entirely new problem. The group then contacted researchers at UC Davis who were working on medical imaging, and they jumped at the chance to solve a real-world problem.  </p>\n<p>In less than five years, the team created a prototype. Taylor, an expert in single-armed industrial robots, built a 7 foot tall robot arm. Instead of a gripper, however, the robot had an industrial milling cutter attachment. Compared to surgical instruments, the sharper cutter reduced the likelihood of fracturing fragile bones. </p>\n<p><img src=\"/static/images/blog/feb22_23/PrototypeRoboDoc.jpg\" alt=\"\" /></p>\n<p>Meanwhile, the UC Davis researchers created the OrthoDoc software to drive the robot. OrthoDoc used a computerized tomography (CT) scan to create a three-dimensional model of the patient’s bone. Then, at a computer workstation, the doctor could identify the exact location, size, and shape of hole that the robot needed to drill. The software translated the doctor’s instructions into Taylor’s AML, and the code was uploaded to the robot. The surgery was fully automated, and the doctors just had to monitor it. </p>\n<p><img src=\"/static/images/blog/feb22_23/UI.jpg\" alt=\"\" /></p>\n<p>All that was left was to name the robot. The team chose “RoboDoc” as an homage to RoboCop, a popular movie of that era.</p>\n<p><img src=\"/static/images/blog/feb22_23/RoboCop.jpg\" alt=\"\" /></p>\n<p>Even with the friendly name RoboDoc, people did not want a robot to operate on living creatures. There was a huge chasm between assembling cars and drilling into people. Therefore, RoboDoc went through a long testing and qualification process, blazing the trail for future robots such as Neuromate and da Vinci. </p>\n<p><strong>Step 1</strong>: 1990 - Total hip replacement on a dog</p>\n<p><strong>Step 2</strong>: 1990-1992 - 25 dogs had hip replacements and recovered faster and better than those who had manual surgery</p>\n<p><strong>Step 3</strong>: 1992 - The U.S. Food and Drug Administration (FDA) approved a trial surgery</p>\n<p><strong>Step 4</strong>: 1992 - On Nov. 7, RoboDoc replaced a human hip</p>\n<p><strong>Step 5</strong>: 1993 - The FDA approved clinical trials across the country</p>\n<p>RoboDoc exceeded the inventors’ expectations. While manual surgeries left gaps well over 1mm between the implant and bone, 95% of RoboDoc’s implants were within 1 mm of the bone. As a result, RoboDoc surgeries did not require bone cement and there was less bone to grow back after the surgery. Patients recovered more quickly and their implants were more stable. To date, RoboDoc has performed over 28,000 operations, with faster recovery times and fewer follow up surgeries. Thirty years later, RoboDoc is in use all around the world.</p>\n<p><img src=\"/static/images/blog/feb22_23/ModernRoboDoc.jpg\" alt=\"\" /></p>\n<p>The RoboDoc team connected robotics, medical imaging, human and veterinary health care to solve real people’s problems. RoboDoc transformed joint replacement surgery and paved the path for other medical robots. Remember, though, RoboDoc didn’t start with a brilliant algorithm or new piece of hardware. It started with people in different disciplines coming together, defining a problem, and then solving it. RoboDoc proves that innovation comes from more than genius - it requires diversity and for people to connect. </p>\n<p><img src=\"/static/images/blog/feb22_23/OnlyConnect.jpg\" alt=\"\" /></p>","title":"History of Robotics #7 - RoboDoc - A Product of Collaboration ","date":"2023-02-22","description":"Tech Support's History of Robotics, #7","thumbnail":"/static/images/blog/feb22_23/PrototypeRoboDoc.jpg"}},"__N_SSG":true}