{"pageProps":{"postData":{"id":"mar7","contentHtml":"<p>This week of school was only two days long, giving us 27 extra hours to get a lot of work done! The Sacramento Regional is starting on the 23rd of March,, and we plan to have our robot finalized the week before.&nbsp;</p>\n<p>2022’s game <em>Rapid React</em>&nbsp;challenges us to create a robot that can pick up and shoot cargo into a scoring hub. Additionally, it must climb up as many as four ascending rungs. With a quick recap of the game, here is what we’ve been finalizing and working on this week!</p>\n<p><strong>Loader:</strong></p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;We added a piece to attach the loader more firmly to the drivetrain and make it more stable.</p>\n<p><img src=\"/static/images/blog/mar7/image2.png\" alt=\"\" /><img src=\"/static/images/blog/mar7/image2.png\" alt=\"\" /></p>\n<p><strong>Hanging Mechanism:</strong></p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;We cut three gussets out of sheets of metal with our CNC machine to attach our hanging mechanism to an old drivetrain.</p>\n<p><strong>Beambreak and Color Sensors:</strong></p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;This week, we have been working on two main sensors, the beam break sensor and the color sensor. The beam break sensor contains a receiver and a transmitter, which can allow us to detect motion. In this case, it would be useful to detect cargo in both the loader and the shooter. On the other hand, the color sensor differentiates the blue and red cargo. We can only score points if we shoot the correct alliance’s color cargo, so this comes in handy.</p>\n<p><strong>Spark Max Motor Controller:</strong></p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;This is our first year working with these types of motor controllers, and we implemented them with the limit switch. We learned how to use the breakout board and wire it correctly. These motor controllers will be used to control NEO motors on both the turrets and intake.</p>\n<p><strong>Magnetic Limit Switches:</strong></p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Magnetic limit switches trigger when a magnetic field enters its proximity. These types of limit switches are ideal as they do not require physical contact to be triggered. We implemented the magnetic limit switches into our turret so that our shooter doesn’t spin too far and break. They work quite well and we will be adding them to our hanging system soon as well.</p>\n<p><strong>Limelight Vision System</strong></p>\n<p>The Limelight camera is a computer vision system that identifies targets in the game. It Allows us to align our turret, which turns the shooter, with the targets</p>\n<p><img src=\"/static/images/blog/mar7/image3.png\" alt=\"\" /><img src=\"/static/images/blog/mar7/image1.png\" alt=\"\" /></p>\n<p><strong>Shepherd’s Gate Robotics Lessons</strong></p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;We have reached out to Shepherd’s Gate to arrange workshops in a collaboration with one of our member’s clubs, Village of Dreams. Soon, we would be able to start up our robotics workshops again!</p>\n<p>As always, we’re proud of our progress but also recognize that there is much to do. Only 2 more weeks until our first competition! Go Cougars!</p>\n<p>-7419 Tech Support’s Writing Crew</p>","title":"This Week in FRC","date":"2022-03-07","description":"Tech Support's update for the week of 3/7","thumbnail":"/static/images/blog/mar7/image2.png"}},"__N_SSG":true}